<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'Полето трябва да бъде прието.',
    'accepted_if' => 'Полето трябва да бъде прието, когато :other е :value.',
    'active_url' => 'Полето трябва да бъде валиден URL адрес.',
    'after' => 'Полето трябва да бъде дата след :date.',
    'after_or_equal' => 'Полето трябва да бъде дата след или равна на :date.',
    'alpha' => 'Полето трябва да съдържа само букви.',
    'alpha_dash' => 'Полето трябва да съдържа само букви, цифри, тирета и долни черти.',
    'alpha_num' => 'Полето трябва да съдържа само букви и цифри.',
    'any_of' => 'Полето е невалидно.',
    'array' => 'Полето трябва да бъде масив.',
    'ascii' => 'Полето трябва да съдържа само еднобайтови букви, цифри и символи.',
    'before' => 'Полето трябва да бъде дата преди :date.',
    'before_or_equal' => 'Полето трябва да бъде дата преди или равна на :date.',
    'between' => [
        'array' => 'Полето трябва да съдържа между :min и :max елемента.',
        'file' => 'Полето трябва да бъде между :min и :max килобайта.',
        'numeric' => 'Полето трябва да бъде между :min и :max.',
        'string' => 'Полето трябва да бъде между :min и :max знака.',
    ],
    'boolean' => 'Полето трябва да бъде вярно или невярно.',
    'can' => 'Полето съдържа неразрешена стойност.',
    'confirmed' => 'Потвърждението не съвпада.',
    'contains' => 'Полето липсва задължителна стойност.',
    'current_password' => 'Паролата е грешна.',
    'date' => 'Полето трябва да бъде валидна дата.',
    'date_equals' => 'Полето трябва да бъде дата, равна на :date.',
    'date_format' => 'Полето трябва да съответства на формата :format.',
    'decimal' => 'Полето трябва да има :decimal десетични знака.',
    'declined' => 'Полето трябва да бъде отхвърлено.',
    'declined_if' => 'Полето трябва да бъде отхвърлено, когато :other е :value.',
    'different' => 'Полето и :other трябва да са различни.',
    'digits' => 'Полето трябва да бъде :digits цифри.',
    'digits_between' => 'Полето трябва да съдържа между :min и :max цифри.',
    'dimensions' => 'Полето има невалидни размери на изображението.',
    'distinct' => 'Полето съдържа дублирана стойност.',
    'doesnt_contain' => 'Полето не трябва да съдържа някое от следните: :values.',
    'doesnt_end_with' => 'Полето не трябва да завършва с някое от следните: :values.',
    'doesnt_start_with' => 'Полето не трябва да започва с някое от следните: :values.',
    'email' => 'Полето трябва да бъде валиден имейл адрес.',
    'ends_with' => 'Полето трябва да завършва с едно от следните: :values.',
    'enum' => 'Избраното поле е невалидно.',
    'exists' => 'Избраното поле е невалидно.',
    'extensions' => 'Полето трябва да има едно от следните разширения: :values.',
    'file' => 'Полето трябва да бъде файл.',
    'filled' => 'Полето трябва да има стойност.',
    'gt' => [
        'array' => 'Полето трябва да съдържа повече от :value елемента.',
        'file' => 'Полето трябва да бъде по-голямо от :value килобайта.',
        'numeric' => 'Полето трябва да бъде по-голямо от :value.',
        'string' => 'Полето трябва да бъде по-дълго от :value знака.',
    ],
    'gte' => [
        'array' => 'Полето трябва да съдържа :value или повече елемента.',
        'file' => 'Полето трябва да бъде по-голямо или равно на :value килобайта.',
        'numeric' => 'Полето трябва да бъде по-голямо или равно на :value.',
        'string' => 'Полето трябва да бъде по-дълго или равно на :value знака.',
    ],
    'hex_color' => 'Полето трябва да бъде валиден хексадесетичен цвят.',
    'image' => 'Полето трябва да бъде изображение.',
    'in' => 'Избраното поле е невалидно.',
    'in_array' => 'Полето трябва да съществува в :other.',
    'in_array_keys' => 'Полето трябва да съдържа поне един от следните ключове: :values.',
    'integer' => 'Полето трябва да бъде цяло число.',
    'ip' => 'Полето трябва да бъде валиден IP адрес.',
    'ipv4' => 'Полето трябва да бъде валиден IPv4 адрес.',
    'ipv6' => 'Полето трябва да бъде валиден IPv6 адрес.',
    'json' => 'Полето трябва да бъде валиден JSON низ.',
    'list' => 'Полето трябва да бъде списък.',
    'lowercase' => 'Полето трябва да бъде с малки букви.',
    'lt' => [
        'array' => 'Полето трябва да съдържа по-малко от :value елемента.',
        'file' => 'Полето трябва да бъде по-малко от :value килобайта.',
        'numeric' => 'Полето трябва да бъде по-малко от :value.',
        'string' => 'Полето трябва да бъде по-кратко от :value знака.',
    ],
    'lte' => [
        'array' => 'Полето не трябва да съдържа повече от :value елемента.',
        'file' => 'Полето трябва да бъде по-малко или равно на :value килобайта.',
        'numeric' => 'Полето трябва да бъде по-малко или равно на :value.',
        'string' => 'Полето трябва да бъде по-кратко или равно на :value знака.',
    ],
    'mac_address' => 'Полето трябва да бъде валиден MAC адрес.',
    'max' => [
        'array' => 'Полето не трябва да съдържа повече от :max елемента.',
        'file' => 'Полето не трябва да бъде по-голямо от :max килобайта.',
        'numeric' => 'Полето не трябва да бъде по-голямо от :max.',
        'string' => 'Полето не трябва да бъде по-дълго от :max знака.',
    ],
    'max_digits' => 'Полето не трябва да съдържа повече от :max цифри.',
    'mimes' => 'Полето трябва да бъде файл от тип: :values.',
    'mimetypes' => 'Полето трябва да бъде файл от тип: :values.',
    'min' => [
        'array' => 'Полето трябва да съдържа поне :min елемента.',
        'file' => 'Полето трябва да бъде поне :min килобайта.',
        'numeric' => 'Полето трябва да бъде поне :min.',
        'string' => 'Полето трябва да бъде поне :min знака.',
    ],
    'min_digits' => 'Полето трябва да съдържа поне :min цифри.',
    'missing' => 'Полето трябва да липсва.',
    'missing_if' => 'Полето трябва да липсва, когато :other е :value.',
    'missing_unless' => 'Полето трябва да липсва, освен ако :other е :value.',
    'missing_with' => 'Полето трябва да липсва, когато :values е налично.',
    'missing_with_all' => 'Полето трябва да липсва, когато :values са налични.',
    'multiple_of' => 'Полето трябва да бъде кратно на :value.',
    'not_in' => 'Избраното поле е невалидно.',
    'not_regex' => 'Форматът е невалиден.',
    'numeric' => 'Полето трябва да бъде число.',
    'password' => [
        'letters' => 'Полето трябва да съдържа поне една буква.',
        'mixed' => 'Полето трябва да съдържа поне една главна и една малка буква.',
        'numbers' => 'Полето трябва да съдържа поне една цифра.',
        'symbols' => 'Полето трябва да съдържа поне един символ.',
        'uncompromised' => 'Дадената стойност е засечена в изтичане на данни. Моля, изберете друга.',
    ],
    'present' => 'Полето трябва да бъде налично.',
    'present_if' => 'Полето трябва да бъде налично, когато :other е :value.',
    'present_unless' => 'Полето трябва да бъде налично, освен ако :other е :value.',
    'present_with' => 'Полето трябва да бъде налично, когато :values е налично.',
    'present_with_all' => 'Полето трябва да бъде налично, когато :values са налични.',
    'prohibited' => 'Полето е забранено.',
    'prohibited_if' => 'Полето е забранено, когато :other е :value.',
    'prohibited_if_accepted' => 'Полето е забранено, когато :other е прието.',
    'prohibited_if_declined' => 'Полето е забранено, когато :other е отхвърлено.',
    'prohibited_unless' => 'Полето е забранено, освен ако :other е в :values.',
    'prohibits' => 'Полето забранява :other да бъде налично.',
    'regex' => 'Форматът е невалиден.',
    'required' => 'Полето е задължително.',
    'required_array_keys' => 'Полето трябва да съдържа записи за: :values.',
    'required_if' => 'Полето е задължително, когато :other е :value.',
    'required_if_accepted' => 'Полето е задължително, когато :other е прието.',
    'required_if_declined' => 'Полето е задължително, когато :other е отхвърлено.',
    'required_unless' => 'Полето е задължително, освен ако :other е в :values.',
    'required_with' => 'Полето е задължително, когато :values е налично.',
    'required_with_all' => 'Полето е задължително, когато :values са налични.',
    'required_without' => 'Полето е задължително, когато :values не е налично.',
    'required_without_all' => 'Полето е задължително, когато нито едно от :values не е налично.',
    'same' => 'Полето трябва да съвпада с :other.',
    'size' => [
        'array' => 'Полето трябва да съдържа :size елемента.',
        'file' => 'Полето трябва да бъде :size килобайта.',
        'numeric' => 'Полето трябва да бъде :size.',
        'string' => 'Полето трябва да бъде :size знака.',
    ],
    'starts_with' => 'Полето трябва да започва с едно от следните: :values.',
    'string' => 'Полето трябва да бъде низ.',
    'timezone' => 'Полето трябва да бъде валидна часова зона.',
    'unique' => 'Вече съществува.',
    'uploaded' => 'Качването се провали.',
    'uppercase' => 'Полето трябва да бъде с главни букви.',
    'url' => 'Полето трябва да бъде валиден URL адрес.',
    'ulid' => 'Полето трябва да бъде валиден ULID.',
    'uuid' => 'Полето трябва да бъде валиден UUID.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],
];
